# Split Function

In [2]:
# Use split() Function to create new variable as dt, time, address

In [3]:
import pandas as pd

In [4]:
df = pd.read_excel(r"C:\Users\darsh\OneDrive\Desktop\FSDS\FSDS_17_02\Sample.xlsx")

In [5]:
df

                                          ADDRES        date            time
0  56th ben colony, btm layout, bangalore ,78909  03-04-2022  5hr 55min 8sec
1         20th stree, johns road, bangalore ,567  06-12-2021  4hr 22min 8sec

In [6]:
df.columns

Index(['ADDRES', 'date', 'time'], dtype='object')

In [7]:
new_df = df['ADDRES'].str.split(r',',expand=True)
new_df

                 0            1            2      3
0  56th ben colony   btm layout   bangalore   78909
1       20th stree   johns road   bangalore     567

In [8]:
new_df.columns = ["Street Address","City","State","Pincode"]
new_df

    Street Address         City        State Pincode
0  56th ben colony   btm layout   bangalore    78909
1       20th stree   johns road   bangalore      567

In [9]:
df['date']

0    03-04-2022
1    06-12-2021
Name: date, dtype: object

In [10]:
new_date = df['date'].str.split(r'-',expand=True)
new_date

    0   1     2
0  03  04  2022
1  06  12  2021

In [11]:
new_date.columns = ["Date","Month","Year"]
new_date

  Date Month  Year
0   03    04  2022
1   06    12  2021

In [46]:
df["time"]

0    5hr 55min 8sec
1    4hr 22min 8sec
Name: time, dtype: object

In [48]:
new_time = df["time"].str.split(r'\s',expand=True)
new_time

     0      1     2
0  5hr  55min  8sec
1  4hr  22min  8sec

In [50]:
new_time.columns = ["Hrs","Min","Sec"]

In [52]:
new_time

   Hrs    Min   Sec
0  5hr  55min  8sec
1  4hr  22min  8sec

In [54]:
new_time['Hrs'] = new_time['Hrs'].str.replace('hr','')
new_time['Min'] = new_time['Min'].str.replace('min','')
new_time['Sec'] = new_time['Sec'].str.replace('sec','')
new_time

  Hrs Min Sec
0   5  55   8
1   4  22   8

In [56]:
Final_Sheet = pd.concat([new_df,new_date,new_time],axis = 1)

In [58]:
Final_Sheet

,Street Address,City,State,Pincode,Date,Month,Year,Hrs,Min,Sec
0,56th ben colony,btm layout,bangalore,78909,03,04,2022,5,55,8
1,20th stree,johns road,bangalore,567,06,12,2021,4,22,8

In [62]:
Final_Data = Final_Sheet.to_csv('Raw to clean data.csv', index=False)

In [64]:
Final_Data

In [66]:
import os 
os.getcwd()

'C:\\Users\\darsh'